tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# GitHub command-line tool
brew "gh"
# Program providing model for GNU coding standards and practices
brew "hello"
# Improved top (interactive process viewer)
brew "htop"
# Load testing and performance measurement application
brew "jmeter"
# Fast, highly customisable system info script
brew "neofetch"
# Show ps output as a tree
brew "pstree"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# App to build and share containerized applications and microservices
cask "docker"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Text editor for code, markup and prose
cask "sublime-text"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Virtualizer for x86 hardware
cask "virtualbox"
#Install GIT code repository
brew "git"
#Install ansible 
brew "ansible"
#Install Java
cask "Java"
#Install Maven
brew "maven"
#Install Gradle
brew "gradle"
